In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\lenovo\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
# !pip install pandas
import numpy as np
import pandas as pd

In [4]:
user_defined = {
    'Marks_A':np.random.randint(50,100,9),
    'Marks_B':np.random.randint(50,100, 9),
    'Marks_c':np.random.randint(50,100, 9),
    'Marks_D':np.random.randint(50,100, 9)
}

In [5]:
user_defined

{'Marks_A': array([62, 90, 81, 64, 72, 72, 84, 78, 64]),
 'Marks_B': array([80, 94, 64, 58, 62, 86, 81, 97, 84]),
 'Marks_c': array([79, 80, 70, 72, 50, 97, 79, 53, 80]),
 'Marks_D': array([97, 99, 90, 87, 97, 62, 98, 63, 52])}

In [6]:
df = pd.DataFrame(user_defined, dtype = int)

In [7]:
df

   Marks_A  Marks_B  Marks_c  Marks_D
0       62       80       79       97
1       90       94       80       99
2       81       64       70       90
3       64       58       72       87
4       72       62       50       97
5       72       86       97       62
6       84       81       79       98
7       78       97       53       63
8       64       84       80       52

In [8]:
df.head()

   Marks_A  Marks_B  Marks_c  Marks_D
0       62       80       79       97
1       90       94       80       99
2       81       64       70       90
3       64       58       72       87
4       72       62       50       97

In [9]:
df.describe()

         Marks_A    Marks_B    Marks_c    Marks_D
count   9.000000   9.000000   9.000000   9.000000
mean   74.111111  78.444444  73.333333  82.777778
std     9.829095  14.054458  14.508618  18.505255
min    62.000000  58.000000  50.000000  52.000000
25%    64.000000  64.000000  70.000000  63.000000
50%    72.000000  81.000000  79.000000  90.000000
75%    81.000000  86.000000  80.000000  97.000000
max    90.000000  97.000000  97.000000  99.000000

In [10]:
my_Data = df.to_csv('Marks.csv')

In [11]:
data = pd.read_csv('Marks.csv')

In [12]:
data.head()

   Unnamed: 0  Marks_A  Marks_B  Marks_c  Marks_D
0           0       62       80       79       97
1           1       90       94       80       99
2           2       81       64       70       90
3           3       64       58       72       87
4           4       72       62       50       97

In [13]:
data = data.drop(columns = ['Unnamed: 0'])

In [16]:
df = pd.read_csv('C:/Users/Lenovo/Dataset/Fish.csv')

In [17]:
df.isnull().sum()

Species    0
Weight     0
Length1    0
Length2    0
Length3    0
Height     0
Width      0
dtype: int64

In [18]:
df.columns

Index(['Species', 'Weight', 'Length1', 'Length2', 'Length3', 'Height',
       'Width'],
      dtype='object')

In [19]:
df.head()

  Species  Weight  Length1  Length2  Length3   Height   Width
0   Bream   242.0     23.2     25.4     30.0  11.5200  4.0200
1   Bream   290.0     24.0     26.3     31.2  12.4800  4.3056
2   Bream   340.0     23.9     26.5     31.1  12.3778  4.6961
3   Bream   363.0     26.3     29.0     33.5  12.7300  4.4555
4   Bream   430.0     26.5     29.0     34.0  12.4440  5.1340

In [20]:
df.shape

(159, 7)

In [21]:
df.iloc[:]

    Species  Weight  Length1  Length2  Length3   Height   Width
0     Bream   242.0     23.2     25.4     30.0  11.5200  4.0200
1     Bream   290.0     24.0     26.3     31.2  12.4800  4.3056
2     Bream   340.0     23.9     26.5     31.1  12.3778  4.6961
3     Bream   363.0     26.3     29.0     33.5  12.7300  4.4555
4     Bream   430.0     26.5     29.0     34.0  12.4440  5.1340
..      ...     ...      ...      ...      ...      ...     ...
154   Smelt    12.2     11.5     12.2     13.4   2.0904  1.3936
155   Smelt    13.4     11.7     12.4     13.5   2.4300  1.2690
156   Smelt    12.2     12.1     13.0     13.8   2.2770  1.2558
157   Smelt    19.7     13.2     14.3     15.2   2.8728  2.0672
158   Smelt    19.9     13.8     15.0     16.2   2.9322  1.8792

[159 rows x 7 columns]

In [22]:
df.iloc[1:5, 1]

1    290.0
2    340.0
3    363.0
4    430.0
Name: Weight, dtype: float64

In [23]:
df.iloc[2:4]

  Species  Weight  Length1  Length2  Length3   Height   Width
2   Bream   340.0     23.9     26.5     31.1  12.3778  4.6961
3   Bream   363.0     26.3     29.0     33.5  12.7300  4.4555

In [24]:
df.iloc[:6, :9]

  Species  Weight  Length1  Length2  Length3   Height   Width
0   Bream   242.0     23.2     25.4     30.0  11.5200  4.0200
1   Bream   290.0     24.0     26.3     31.2  12.4800  4.3056
2   Bream   340.0     23.9     26.5     31.1  12.3778  4.6961
3   Bream   363.0     26.3     29.0     33.5  12.7300  4.4555
4   Bream   430.0     26.5     29.0     34.0  12.4440  5.1340
5   Bream   450.0     26.8     29.7     34.7  13.6024  4.9274

In [28]:
df.columns.get_loc('Weight')  #index of this column

1

In [30]:
idx = [df.columns.get_loc('Weight'),df.columns.get_loc("Height")]

In [31]:
idx

[1, 5]